results/factorial-final/security-overhead-final-tls-broker5/security-overhead-final-factorial-tls-b5-rf3-isr3-msg10240-tps10000-batch131072-acksall-prod1-compnone-trial3/producer-perf-1.log
producer_index=1
producer_count=1
producer_records=100000
producer_throughput=10000
23374 records sent, 4672.0 records/sec (45.62 MB/sec), 376.0 ms avg latency, 1429.0 ms max latency.
50552 records sent, 10108.4 records/sec (98.71 MB/sec), 11.9 ms avg latency, 92.0 ms max latency.
100000 records sent, 8149.295086 records/sec (79.58 MB/sec), 96.38 ms avg latency, 1429.00 ms max latency, 10 ms 50th, 703 ms 95th, 933 ms 99th, 1048 ms 99.9th.